{
	// характеристики спрайта
	sprite : {
		// источник
		src: "i/chars.png",
		
		// размеры
		width: 64,
		height: 64,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [5,0], [5,1], [5,2], [5,3], [5,2], [5,1] ],
		dmg:[ [5,6], [5,5], [5,4], [5,4] ],
		attack1:[ [5,6], [5,8], [5,6] ],
		attack2:[ [5,9], [5,10], [5,11] ],
		block:[ [5,6], [5,6] ,[5,6] ,[5,6]  ]
	},
	
	/** Харарктеристики персонажа
	*/
	maxLevel: 3,
	character: {
		def: [8, 10, 12],
		defkawaii: [30, 35, 40],
		spd: [3, 4, 4],
		exp: [10, 20, 40],
		hp: [9, 13, 17],
		att1: [10, 12, 15],
		dmg1: [[2,4], [3,5], [4,6]],
	},
	
	
	/** действия при альтернативной атаке
	 *
	 */
	doAttack2: function(person) {
	},

	checkCell: function(char, cell, act) {
		act.push('summ');
	}
}
