{
	title:'Чен',
	desc:'Кошка-шикигами, персонаж низкого уровня.',
	levels:[
		{skills:['attack1'],		
			desc:'Когти. Ближний бой.'},
		{skills:['attack1', 'attack2'],
			desc:'Подмигнуть. Дистанция. Ослаюляет защиту противника на несколько ходов.'},			
		{skills:['attack1', 'attack2', ],
			desc:'Кошка. Если противник пройдет рядом с Чен, у нее появится шанс атаковать его.'},
	],
	// характеристики спрайта
	sprite : {
		// источник
		src: "i/chars.png",
		
		// размеры
		width: 64,
		height: 64,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [4,0], [4,1], [4,2], [4,3], [4,2], [4,1] ],
		dmg:[ [4,6], [4,5], [4,4], [4,4] ],
		attack1:[ [4,6], [4,8], [4,9], [4,6] ],
		attack2:[ [4,9], [4,10], [4,10] ],
		block:[ [4,6], [4,6], [4,6], [4,6] ]
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		att1type: ['knife'],//режущий удар
		def: [8, 10, 12],
		defkawaii: [30, 35, 40],
		spd: [5, 6, 6],
		exp: [10, 20, 40],
		hp: [9, 13, 17],
		att1: [10, 12, 15],
		dmg1: [[2,4], [3,5], [4,6]],
		att2: [12, 14, 18],
		att2type: ['kawaii'],
		dmg2: [[2,5], [3,6], [4,7]],
	},
	
	/** действия при альтернативной атаке
	 * уменьшает защиту поротивника 
	 */
	//doAttack2: function(self, person, fast) {
	//	
	//},
	
	/** движение другого персонажа в точку
	 * если мимо чен пройдет противник, она с некоторой вероятностью сможет нанести удар
	 */
	onPersonMove: function(person, tX, tY) {
	}
}
