{
	title:'Гриб',
	desc:'Наступательный гриб',	// характеристики спрайта
	sprite : {
		// источник
		src: "i/frog.png",
		
		// размеры
		width: 48,
		height: 48,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [0,6], [0,7], [0,8], [0,9], [0,10], [0,11], [0,12]],
		dmg:[ [1,0], [1,0], [1,0], [1,0], [1,0], [1,0]],
		attack1:[ [0,1], [0,2], [0,3], [0,4], [0,5]],
		attack2:[ [0,1], [0,2], [0,3], [0,4], [0,5]],
		block:[ [0,1], [0,2], [0,3], [0,4], [0,5]],
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		def: [7, 9, 12],
		spd: [2, 2, 3],
		exp: [15, 20, 40],
		hp: [10, 15, 20],
		att1: [10, 12, 15],
		dmg1: [[1,3], [1,4], [2,5]],
	},
}
