{
	title:'Гриб',
	desc:'Наступательный гриб',	// характеристики спрайта
	sprite : {
		// источник
		src: "i/monsters1.png",
		
		// размеры
		width: 32,
		height: 32,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [2,7], [2,8]],
		dmg:[ [2,8], [2,8], [2,8], [2,8], [2,8]],
		attack1:[ [2,8], [2,8], [2,7], [2,6], [2,6], [2,7] ],
		attack2:[ [2,8], [2,8], [2,7], [2,6], [2,6], [2,7] ],
		block:[ [2,8], [2,8], [2,6], [2,6], [2,6], [2,7]],
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		def: [4, 6, 8],
		spd: [4, 4, 5],
		exp: [10, 20, 40],
		hp: [6, 8, 10],
		att1: [10, 12, 15],
		dmg1: [[1,2], [1,3], [2,4]],
	},
}
