{
	title:'Желтый гриб',
	desc:'Крепкий наступательный гриб',	// характеристики спрайта
	sprite : {
		// источник
		src: "i/monsters1.png",
		
		// размеры
		width: 32,
		height: 32,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [6,1], [6,2]],
		dmg:[ [6,2], [6,2], [6,2], [6,2], [6,2]],
		attack1:[ [6,2], [6,2], [6,1], [6,0], [6,0], [6,1] ],
		attack2:[ [6,2], [6,2], [6,1], [6,0], [6,0], [6,1] ],
		block:[ [6,2], [6,2], [6,0], [6,0], [6,0], [6,1]],
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		def: [12, 15, 20],
		spd: [3, 3, 4],
		exp: [10, 20, 40],
		hp: [15, 20, 25],
		att1: [8, 10, 12],
		dmg1: [[1,2], [1,3], [2,4]],
	},
}
