{
	title:'Красный гриб',
	desc:'Дерзкий наступательный гриб',	// характеристики спрайта
	sprite : {
		// источник
		src: "i/monsters1.png",
		
		// размеры
		width: 32,
		height: 32,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [2,10], [2,11]],
		dmg:[ [2,11], [2,11], [2,11], [2,11], [2,11]],
		attack1:[ [2,11], [2,11], [2,10], [2,9], [2,9], [2,10] ],
		attack2:[ [2,11], [2,11], [2,10], [2,9], [2,9], [2,10] ],
		block:[ [2,11], [2,11], [2,9], [2,9], [2,9], [2,10]],
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		def: [4, 6, 8],
		spd: [5, 5, 6],
		exp: [10, 20, 40],
		hp: [6, 8, 10],
		att1: [12, 15, 120],
		dmg1: [[1,4], [2,6], [3,9]],
	},
}
