{
	// характеристики спрайта
	sprite : {
		// источник
		src: "i/chars.png",
		
		// размеры
		width: 64,
		height: 64,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [1,0], [1,1], [1,2], [1,3], [1,2], [1,1] ],
		fly:[ [0,0], [0,1], [0,2], [0,3], [0,2], [0,1] ],
		dmg:[ [1,6], [1,5], [1,4], [1,4] ],
		attack1:[ [1,6], [1,7], [1,8], [1,6] ],
		attack2:[ [1,9], [1,10], [1,11] ],
		block:[ [1,6], [1,6], [1,6], [1,6] ]
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		att1: [10, 12, 15],
		def: [8, 10, 12],
		defkawaii: [30, 35, 40],
		spd: [4, 4, 4],
		exp: [10, 20, 40],
		hp: [9, 13, 17],
		dmg1: [[2,4], [3,5], [4,6]],
	},

	/** действия при альтернативной атаке
	 *
	 */
	doAttack2: function(person) {
	},
	
}
