{
	// характеристики спрайта
	sprite : {
		// источник
		src: "i/chars.png",
		
		// размеры
		width: 64,
		height: 64,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [3,0], [3,1], [3,2], [3,3], [3,2], [3,1] ],
		dmg:[ [3,6], [3,5], [3,4], [3,4] ],
		attack1:[ [3,6], [3,8], [3,6] ],
		attack2:[ [3,9], [3,10], [3,11] ],
		block:[ [3,6], [3,6], [3,6], [3,6] ]
	},

	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		def: [8, 10, 12],
		defkawaii: [30, 35, 40],
		spd: [4, 5, 5],
		exp: [10, 20, 40],
		hp: [9, 13, 17],
		att1: [15, 20, 25],
		dmg1: [[1,2], [2,4], [3,6]],
		dist1: [3, 4, 5]
	},
	
	/** действия при альтернативной атаке
	 *
	 */
	doAttack2: function(person) {
	},
	
}
