{
	// характеристики спрайта
	sprite : {
		// источник
		src: "i/chars.png",
		
		// размеры
		width: 64,
		height: 64,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [6,0], [6,1], [6,2], [6,3], [6,2], [6,1] ],
		dmg:[ [6,6], [6,5], [6,4], [6,4] ],
		attack1:[ [6,6], [6,8], [6,6] ],
		attack2:[ [6,9], [6,9], [6,10], [6,11] ],
		block:[ [6,6], [6,6], [6,6], [6,6] ]
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		def: [8, 10, 12],
		defkawaii: [30, 35, 40],
		spd: [6, 6, 7],
		exp: [10, 20, 40],
		hp: [9, 13, 17],
		att1: [10, 12, 15],
		dmg1: [[2,4], [3,5], [4,6]],
	},

	/** действия при альтернативной атаке
	 *
	 */
	doAttack2: function(person) {
	},
}
