{
	// характеристики спрайта
	sprite : {
		// источник
		src: "i/chars.png",
		
		// размеры
		width: 64,
		height: 64,
		
		// центр
		x: 32,
		y: 64		
	},
	
	// анимация
	animations:{
		idle:[ [8,0], [8,1], [8,2], [8,3], [8,2], [8,1] ],
		dmg:[ [8,6], [8,5], [8,4], [8,4] ],
		attack1:[ [8,6], [8,8], [8,6] ],
		attack2:[ [8,9], [8,10], [8,11] ],
		block:[ [8,6], [8,6], [8,6], [8,6] ]
	},
	
	/** Харарктеристики персонажа
	 */
	maxLevel: 3,
	character: {
		def: [8, 10, 12],
		defkawaii: [30, 35, 40],
		spd: [6, 6, 7],
		exp: [10, 20, 40],
		hp: [9, 13, 17],
		att1: [10, 12, 15],
		dmg1: [[2,4], [3,5], [4,6]],
	},
	
	/** действия при альтернативной атаке
	 *
	 */
	doAttack2: function(person) {
	},
}
